#+title: Containers

* Images
#+begin_src sh :results output table :colnames '("Image" "Size" "Arch" "Layers")
for img in $(docker images --format '{{.Repository}}' --filter 'reference=bits-*' | sort); do
  size=$(docker images "${img}:latest" --format '{{.Size}}')
  arch=$(docker inspect "${img}:latest" --format '{{.Architecture}}')
  layers=$(docker inspect "${img}:latest" --format '{{len .RootFS.Layers}}')
  printf '%s\t%s\t%s\t%s\n' "$img" "$size" "$arch" "$layers"
done
#+end_src

#+results:
| Image            | Size   | Arch  | Layers |
|------------------+--------+-------+--------|
| bits-error-pages | 89.8MB | arm64 |      1 |
| bits-jaeger      | 186MB  | arm64 |      1 |
| bits-postgres    | 2.88GB | arm64 |      1 |
| bits-traefik     | 253MB  | arm64 |      1 |
| bits-transactor  | 2.18GB | arm64 |      1 |

* Orchestration
=compose.yml= defines all services. =just dev= starts everything.

#+begin_src sh :results output verbatim
docker compose config --services | sort
#+end_src

#+results:
: error-pages
: jaeger
: nrepl
: postgres
: tailwind
: traefik
: transactor
